In [593]:
print("hello world")

hello world

#This is a title     

This is my notes

In [594]:
pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\programdata\anaconda3\lib\site-packages (1.2.2)
Requirement already satisfied: numpy>=1.17.3 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.26.4)
Requirement already satisfied: scipy>=1.3.2 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.11.4)
Requirement already satisfied: joblib>=1.1.1 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.2.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (2.2.0)
Note: you may need to restart the kernel to use updated packages.

In [595]:
import pandas as pd
import numpy as np

In [596]:
from sklearn.datasets import fetch_openml

# Load Titanic dataset
titanic = fetch_openml("titanic", version=1, as_frame=True)

df = titanic.frame
df.head()

c:\ProgramData\anaconda3\Lib\site-packages\sklearn\datasets\_openml.py:968: FutureWarning: The default value of `parser` will change from `'liac-arff'` to `'auto'` in 1.4. You can set `parser='auto'` to silence this warning. Therefore, an `ImportError` will be raised from 1.4 if the dataset is dense and pandas is not installed. Note that the pandas parser may return different data types. See the Notes Section in fetch_openml's API doc for details.
  warn(
c:\ProgramData\anaconda3\Lib\site-packages\sklearn\datasets\_arff_parser.py:200: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  frame = pd.concat(dfs, ignore_index=True)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"

In [597]:
missing_values = df.isnull().sum()
print("Missing values before cleaning:")
print(missing_values)

Missing values before cleaning:
pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [598]:
num_cols = df.select_dtypes(include=["float64", "int64"]).columns

df[num_cols] = df[num_cols].fillna(df[num_cols].median())

In [599]:
missing_values = df.isnull().sum()
print("Missing values before cleaning:")
print(missing_values)

Missing values before cleaning:
pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin        1014
embarked        2
boat          823
body            0
home.dest     564
dtype: int64

In [600]:
duplicates = df.duplicated().sum()
print(f"\nNumber of duplicate rows before cleaning: {duplicates}")

Number of duplicate rows before cleaning: 0

In [601]:
print("\nUnique values in 'Sex' column before cleaning:")
print(df['sex'].unique())

Unique values in 'Sex' column before cleaning:
['female', 'male']
Categories (2, object): ['female', 'male']

In [602]:
df.sex.value_counts()   

df['sex'] = df.sex.str.upper()  

df.sex.value_counts()

sex
MALE      843
FEMALE    466
Name: count, dtype: int64

In [603]:
Q1 = df['fare'].quantile(0.25) # calculates the first quartile
Q3 = df['fare'].quantile(0.75) # calculates the third quartile
IQR = Q3 - Q1 # computes the IQR

# Below, we find all the data points that fall below the lower bound or above the upper bound
outliers = df['fare'][
    (df['fare'] < (Q1 - 1.5 * IQR)) |
    (df['fare'] > (Q3 + 1.5 * IQR))
]

In [604]:

# Outlier detection - 'Age'
mean_age = np.mean(df['age']) # calculates the mean
std_dev_age = np.std(df['age']) # calculates the standard deviation
Z_scores_age = (df['age'] - mean_age) / std_dev_age # computes the Z-scores
outliers_age = df['age'][np.abs(Z_scores_age) > 3] # finds all the data points that are 3 standard deviations away from the mean
print("Outliers in 'Age' using Z-score: \n", outliers_age)

# Outlier detection - 'Fare'
mean_fare = np.mean(df['fare']) # calculates the mean
std_dev_fare = np.std(df['fare']) # calculates the standard deviation
Z_scores_fare = (df['fare'] - mean_fare) / std_dev_fare # computes the Z-scores
outliers_fare = df['fare'][np.abs(Z_scores_fare) > 3] # finds all the data points that are 3 standard deviations away from the mean
print("\nOutliers in 'Fare' using Z-score: \n", outliers_fare)

Outliers in 'Age' using Z-score:
 9       71.0
14      80.0
61      76.0
81      70.0
135     71.0
506     70.0
727     70.5
1235    74.0
Name: age, dtype: float64

Outliers in 'Fare' using Z-score:
 0      211.3375
10     227.5250
11     227.5250
16     247.5208
17     247.5208
23     227.5250
24     221.7792
35     262.3750
49     512.3292
50     512.3292
66     262.3750
97     247.5208
103    227.5250
106    221.7792
111    263.0000
112    263.0000
113    263.0000
114    263.0000
115    263.0000
116    263.0000
129    211.5000
173    211.5000
180    211.3375
183    512.3292
193    211.3375
237    227.5250
238    211.3375
249    262.3750
250    262.3750
251    262.3750
252    262.3750
253    262.3750
285    221.7792
286    221.7792
302    512.3292
312    211.5000
313    211.5000
314    211.5000
Name: fare, dtype: float64

In [605]:
# Drop rows with missing 'age' values
df = df.dropna(subset=['age'])

# Calculate the upper bound for 'age'
Q1 = df['age'].quantile(0.25)
Q3 = df['age'].quantile(0.75)
IQR = Q3 - Q1
upper_bound = Q3 + 1.5 * IQR

# Cap the outliers for 'age'
df['age'] = np.where(df['age'] > upper_bound, upper_bound, df['age'])

# Calculate the upper bound for 'fare'
Q1 = df['fare'].quantile(0.25)
Q3 = df['fare'].quantile(0.75)
IQR = Q3 - Q1
upper_bound = Q3 + 1.5 * IQR

# Cap the outliers for 'fare'
df['fare'] = np.where(df['fare'] > upper_bound, upper_bound, df['fare'])

In [606]:
print(f"\nRows after removing outliers: {df.shape[0]}")

Rows after removing outliers: 1309

In [607]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   category
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1309 non-null   float64
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   category
 11  boat       486 non-null    object
 12  body       1309 non-null   float64
 13  home.dest  745 non-null    object
dtypes: category(2), float64(6), object(6)
memory usage: 125.7+ KB

In [608]:
missing_values = df.isnull().sum()  
missing_values

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin        1014
embarked        2
boat          823
body            0
home.dest     564
dtype: int64

In [609]:
df.describe()

,pclass,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000
mean,2.294882,29.154826,0.498854,0.385027,24.279696,155.537051
std,0.837836,12.047130,1.041658,0.865560,20.789492,29.639390
min,1.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,22.000000,0.000000,0.000000,7.895800,155.000000
50%,3.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,35.000000,1.000000,0.000000,31.275000,155.000000
max,3.000000,54.500000,8.000000,9.000000,66.343800,328.000000

In [610]:
#ouliers >1.5*IQR   

Q1_age = df['age'].quantile(0.25)
Q3_age = df['age'].quantile(0.75)
IQR_age = Q3_age - Q1_age

Q1_fare = df['fare'].quantile(0.25)
Q3_fare = df['fare'].quantile(0.75)
IQR_fare = Q3_fare - Q1_fare

print(IQR_age, IQR_fare)

13.0 23.379199999999997

In [611]:
age_outliers = df[(df['age'] < (Q1_age - 1.5 * IQR_age)) | (df['age'] > (Q3_age + 1.5 * IQR_age))]
fare_outliers = df[(df['fare'] < (Q1_fare - 1.5 * IQR_fare)) | (df['fare'] > (Q3_fare + 1.5 * IQR_fare))]

In [612]:
age_outliers.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1,1.0,1,"Allison, Master. Hudson Trevor",MALE,0.9167,1.0,2.0,113781,66.3438,C22 C26,S,11,155.0,"Montreal, PQ / Chesterville, ON"
2,1.0,0,"Allison, Miss. Helen Loraine",FEMALE,2.0000,1.0,2.0,113781,66.3438,C22 C26,S,None,155.0,"Montreal, PQ / Chesterville, ON"
339,2.0,1,"Becker, Master. Richard F",MALE,1.0000,2.0,1.0,230136,39.0000,F4,S,11,155.0,"Guntur, India / Benton Harbour, MI"
359,2.0,1,"Caldwell, Master. Alden Gates",MALE,0.8333,0.0,2.0,248738,29.0000,None,S,13,155.0,"Bangkok, Thailand / Roseville, IL"
427,2.0,1,"Hamalainen, Master. Viljo",MALE,0.6667,1.0,1.0,250649,14.5000,None,S,4,155.0,"Detroit, MI"

In [613]:
fare_outliers.head()

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []

In [614]:
df['Family_Size'] = df['sibsp'] + df['parch'] + 1

# Verify by displaying the new column
print("\nFamily Size feature:")
print(df[['sibsp', 'parch', 'Family_Size']].head())

Family Size feature:
   sibsp  parch  Family_Size
0    0.0    0.0          1.0
1    1.0    2.0          4.0
2    1.0    2.0          4.0
3    1.0    2.0          4.0
4    1.0    2.0          4.0

In [615]:
label_encoder = LabelEncoder()
df['embarked'] = label_encoder.fit_transform(df['embarked'])

print(df[['embarked']].head())

   embarked
0         2
1         2
2         2
3         2
4         2

In [616]:
df['name'] = df['name'].apply(lambda x: re.sub(r'(Mr\.|Mrs\.|Dr\.|miss\.|master\.)', '', x))
df['name'] = df['name'].str.lower()


print(df[['name']].head())

                                          name
0                allen, miss. elisabeth walton
1               allison, master. hudson trevor
2                 allison, miss. helen loraine
3            allison,  hudson joshua creighton
4  allison,  hudson j c (bessie waldo daniels)

In [617]:
bins = [0, 12, 18, 64, 100]
labels = ['Child', 'Teen', 'Adult', 'Senior']

df['Age_Group'] = pd.cut(df['age'], bins=bins, labels=labels)

print(df[['age', 'Age_Group']].head())

       age Age_Group
0  29.0000     Adult
1   0.9167     Child
2   2.0000     Child
3  30.0000     Adult
4  25.0000     Adult

In [618]:
df["Ticket_Purchase_Date"] = pd.to_datetime(
    np.random.choice(pd.date_range("1900-01-01", "1912-04-15"), size=len(df))
)

df['Ticket_Purchase_Date'] = pd.to_datetime(df['Ticket_Purchase_Date'])

df['Purchase_Year'] = df['Ticket_Purchase_Date'].dt.year
df['Purchase_Month'] = df['Ticket_Purchase_Date'].dt.month


print(df[['Ticket_Purchase_Date', 'Purchase_Year', 'Purchase_Month']].head())

  Ticket_Purchase_Date  Purchase_Year  Purchase_Month
0           1900-08-28           1900               8
1           1909-05-18           1909               5
2           1910-10-24           1910              10
3           1908-09-30           1908               9
4           1903-03-10           1903               3